Reports/ПроверкаСуммыВходящегоНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ПроверкаСуммыВходящегоНДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ПриобретенияНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ПриобретенияНалоговыйУчет</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСПропорционально</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНДСПодтвержденный</Name>
					<Comment>Используется только в операциях закрытия неполного возврата (вида "по оплате"), для формирования кросс-проводки при взаиморасчетах по расч. документах</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВозвратнаяТара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПриобретенияНалоговыйУчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДляХозяйственнойДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельностиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Амортизируется</Name>
					<Comment>Поставка Основных фондов. Исользуется для запонения Приложения 5 к Декларации по НДС (с 2008 г)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОжидаемыйИПодтвержденныйНДСПриобретений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОжидаемыйИПодтвержденныйНДСПриобретений</Name>
			<Comment>(Регл) </Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БазаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСПропорционально</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВозвратнаяТара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СобытиеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияОжидаемыйИПодтвержденныйНДСПриобретений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДляХозяйственнойДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельностиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Амортизируется</Name>
					<Comment>Поставка Основных фондов. Исользуется для запонения Приложения 5 к Декларации по НДС (с 2008 г)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыДеятельностиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДеятельностиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Облагаемая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Необлагаемая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОблагаемая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/МоментыОпределенияНалоговойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>МоментыОпределенияНалоговойБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПервомуСобытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОпределять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СобытияПриобретенияНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СобытияПриобретенияНалоговыйУчет</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СобытияОжидаемыйИПодтвержденныйНДСПриобретений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СобытияОжидаемыйИПодтвержденныйНДСПриобретений</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ПроверкаСуммыВходящегоНДС/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета по метаданным регистра накопления
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "ПриобретенияНалоговыйУчет";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	
	// Описание исходного текста запроса.
	
    ТекстЗапроса = 
		  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		  |	ВложенныйЗапрос.Организация КАК Организация,
		  |	ВЫБОР
		  |		КОГДА ВложенныйЗапрос.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		  |				ИЛИ ВложенныйЗапрос.ДоговорКонтрагента.Внешнеэкономический = ЛОЖЬ
		  |			ТОГДА &Гривна
		  |		ИНАЧЕ ВложенныйЗапрос.ДоговорКонтрагента.ВалютаВзаиморасчетов
		  |	КОНЕЦ КАК Валюта,
		  |	ВложенныйЗапрос.Контрагент КАК Контрагент,
		  |	ВложенныйЗапрос.ДоговорКонтрагента КАК ДоговорКонтрагента,
		  |	ВложенныйЗапрос.ЗаТару КАК ЗаТару,
		  |	ВложенныйЗапрос.ВидРасчетов КАК ВидРасчетов,
		  |	ВложенныйЗапрос.Схема КАК Схема,
		  |	ВложенныйЗапрос.ПериодДень КАК ПериодДень,
		  |	ВложенныйЗапрос.НалоговыйДокумент КАК НалоговыйДокумент,
		  |	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
		  |	ВложенныйЗапрос.ДляХозяйственнойДеятельности КАК ДляХозяйственнойДеятельности,
		  |	ВложенныйЗапрос.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		  |	ВложенныйЗапрос.Амортизируется КАК Амортизируется,
		  |	ВложенныйЗапрос.Сделка КАК Сделка,
		  |	ВложенныйЗапрос.СложныйНалоговыйУчет КАК СложныйНалоговыйУчет,
		  |	ВложенныйЗапрос.ПервоеСобытие КАК ПервоеСобытие,
		  |	ВложенныйЗапрос.ПервоеСобытиеНДС КАК ПервоеСобытиеНДС,
		  |	ВложенныйЗапрос.ПоДокументу КАК ПоДокументу,
		  |	ВложенныйЗапрос.ПоДокументуНДС КАК ПоДокументуНДС,
		  |	ВложенныйЗапрос.ВыписаноНН КАК ВыписаноНН,
		  |	ВложенныйЗапрос.ВыписаноНННДС КАК ВыписаноНННДС,
		  |	ВЫБОР 
		  |		КОГДА ВложенныйЗапрос.ДоговорКонтрагента.СложныйНалоговыйУчет
		  |			ТОГДА 0
		  | ИНАЧЕ ВложенныйЗапрос.ПервоеСобытие - ВложенныйЗапрос.ВыписаноНН 
		  |	КОНЕЦ КАК РазницаУчетВыписано,
		  |	ВЫБОР 
		  |		КОГДА ВложенныйЗапрос.ДоговорКонтрагента.СложныйНалоговыйУчет
		  |			ТОГДА 0
		  | ИНАЧЕ ВложенныйЗапрос.ПервоеСобытиеНДС - ВложенныйЗапрос.ВыписаноНННДС 
		  | КОНЕЦ КАК РазницаУчетВыписаноНДС,
		  |	ВЫБОР
		  |		КОГДА ВложенныйЗапрос.ДоговорКонтрагента.СложныйНалоговыйУчет
		  |				ИЛИ ВложенныйЗапрос.ВыписаноНН <> 0
		  |			ТОГДА 0
		  |		ИНАЧЕ ВложенныйЗапрос.ПервоеСобытие - ВложенныйЗапрос.ПоДокументу
		  |	КОНЕЦ КАК РазницаУчетДокумент,
		  |	ВЫБОР
		  |		КОГДА ВложенныйЗапрос.ДоговорКонтрагента.СложныйНалоговыйУчет
		  |				ИЛИ ВложенныйЗапрос.ВыписаноНН <> 0
		  |			ТОГДА 0
		  |		ИНАЧЕ ВложенныйЗапрос.ПервоеСобытиеНДС - ВложенныйЗапрос.ПоДокументуНДС
		  |	КОНЕЦ КАК РазницаУчетДокументНДС
		  |{ВЫБРАТЬ
		  |	Организация.*,
		  |	Контрагент.*,
		  |	ДоговорКонтрагента.*,
		  |	ЗаТару,
		  |	ВидРасчетов,
		  |	Схема,
		  |	ПервоеСобытие,
		  |	ПериодДень,
		  |	Сделка.*,
		  |	СтавкаНДС.*,
		  |	ДляХозяйственнойДеятельности,
		  |	ВидДеятельностиНДС,
		  |	Амортизируется,
		  |	СложныйНалоговыйУчет,
		  |	НалоговыйДокумент.*,
		  
		  
		  |	ПервоеСобытие,
		  |	ПервоеСобытиеНДС,
		  |	ПоДокументу,
		  |	ПоДокументуНДС,
		  
		  |	ВыписаноНН,
		  |	ВыписаноНННДС,
		  |	РазницаУчетВыписано,
		  |	РазницаУчетВыписаноНДС,
		  |	РазницаУчетДокумент,
		  |	РазницаУчетДокументНДС}
		  |ИЗ
		  |	(ВЫБРАТЬ
		  |		Данные.Организация КАК Организация,
		  |		Данные.Контрагент КАК Контрагент,
		  |		Данные.ДоговорКонтрагента КАК ДоговорКонтрагента,
		  |		Данные.ЗаТару КАК ЗаТару,
		  |		Данные.ВидРасчетов КАК ВидРасчетов,
		  |		Данные.Схема КАК Схема,
		  |		Данные.ПериодДень КАК ПериодДень,
		  |		Данные.НалоговыйДокумент КАК НалоговыйДокумент,
		  |		Данные.СтавкаНДС КАК СтавкаНДС,
		  |		ВЫБОР
		  |			КОГДА Данные.ДоговорКонтрагента.СложныйНалоговыйУчет
		  |				ТОГДА """"
		  |			КОГДА Данные.ДляХозяйственнойДеятельности
		  |				ТОГДА ""Для хоз. деят.""
		  |			ИНАЧЕ ""Для не хоз. деят.""
		  |		КОНЕЦ КАК ДляХозяйственнойДеятельности,
		  |		ВЫБОР
		  |			КОГДА Данные.ДоговорКонтрагента.СложныйНалоговыйУчет
		  |				ТОГДА """"
		  |			КОГДА Данные.ВидДеятельностиНДС = &НеоблагаемыйВидДеятельностиНДС
		  |				ТОГДА ""Для операций не облаг. НДС""
		  |			КОГДА Данные.ВидДеятельностиНДС = &ПропорциональныйНДС
		  |				ТОГДА ""Пропорц. отнесение НДС на кредит""
		  |			ИНАЧЕ ""Для операций облаг. НДС""
		  |		КОНЕЦ КАК ВидДеятельностиНДС,
		  |		ВЫБОР
		  |			КОГДА Данные.ДоговорКонтрагента.СложныйНалоговыйУчет
		  |				ТОГДА """"
		  |			КОГДА Данные.Амортизируется
		  |				ТОГДА ""Амортизируется""
		  |			ИНАЧЕ ""Не амортизируется""
		  |		КОНЕЦ КАК Амортизируется,
		  |		Данные.Сделка КАК Сделка,
		  |		ВЫБОР
		  |			КОГДА Данные.ДоговорКонтрагента.СложныйНалоговыйУчет
		  |		ТОГДА ""Сложный нал. учет""
		  |			ИНАЧЕ ""Упрощенный нал. учет""
		  |		КОНЕЦ КАК СложныйНалоговыйУчет,
		  |		ВЫБОР
		  |			КОГДА Данные.Схема = &ПоОтгрузке
		  |				ТОГДА Данные.РасчетыОтгрузПрих
		  |			КОГДА Данные.Схема = &ПоОплате
		  |				ТОГДА Данные.РасчетыОплатаПрих
		  |			КОГДА Данные.Схема = &ПоПервомуСобытию
		  |				ТОГДА ВЫБОР
		  |						КОГДА Данные.РасчетыОтгрузНач + Данные.РасчетыОтгрузПрих > Данные.РасчетыОплатаНач + Данные.РасчетыОплатаПрих
		  |							ТОГДА Данные.РасчетыОтгрузНач + Данные.РасчетыОтгрузПрих
		  |						ИНАЧЕ Данные.РасчетыОплатаНач + Данные.РасчетыОплатаПрих
		  |					КОНЕЦ - ВЫБОР
		  |						КОГДА Данные.РасчетыОтгрузНач > Данные.РасчетыОплатаНач
		  |							ТОГДА Данные.РасчетыОтгрузНач
		  |						ИНАЧЕ Данные.РасчетыОплатаНач
		  |					КОНЕЦ
		  |			ИНАЧЕ 0
		  |		КОНЕЦ КАК ПервоеСобытие,
		  |		ВЫБОР
		  |			КОГДА Данные.Схема = &ПоОтгрузке
		  |				ТОГДА Данные.РасчетыОтгрузПрихНДС
		  |			КОГДА Данные.Схема = &ПоОплате
		  |				ТОГДА Данные.РасчетыОплатаПрихНДС
		  |			КОГДА Данные.Схема = &ПоПервомуСобытию
		  |				ТОГДА ВЫБОР
		  |						КОГДА Данные.РасчетыОтгрузНачНДС + Данные.РасчетыОтгрузПрихНДС > Данные.РасчетыОплатаНачНДС + Данные.РасчетыОплатаПрихНДС
		  |							ТОГДА Данные.РасчетыОтгрузНачНДС + Данные.РасчетыОтгрузПрихНДС
		  |						ИНАЧЕ Данные.РасчетыОплатаНачНДС + Данные.РасчетыОплатаПрихНДС
		  |					КОНЕЦ - ВЫБОР
		  |						КОГДА Данные.РасчетыОтгрузНачНДС > Данные.РасчетыОплатаНачНДС
		  |							ТОГДА Данные.РасчетыОтгрузНачНДС
		  |						ИНАЧЕ Данные.РасчетыОплатаНачНДС
		  |					КОНЕЦ
		  |			ИНАЧЕ 0
		  |		КОНЕЦ КАК ПервоеСобытиеНДС,
		  |		ВЫБОР
		  |			КОГДА Данные.ДоговорКонтрагента.СложныйНалоговыйУчет
		  |				ТОГДА 0
		  |			ИНАЧЕ Данные.ПоДокументу
		  |		КОНЕЦ КАК ПоДокументу,
		  |		ВЫБОР
		  |			КОГДА Данные.ДоговорКонтрагента.СложныйНалоговыйУчет
		  |				ТОГДА 0
		  |			ИНАЧЕ Данные.ПоДокументуНДС
		  |		КОНЕЦ КАК ПоДокументуНДС,
		  |		Данные.ВыписаноНН КАК ВыписаноНН,
		  |		Данные.ВыписаноНННДС КАК ВыписаноНННДС
		  |	ИЗ
		  |		(ВЫБРАТЬ
		  |			Суммы.Организация КАК Организация,
		  |			Суммы.ДоговорКонтрагента.Владелец КАК Контрагент,
		  |			Суммы.ДоговорКонтрагента КАК ДоговорКонтрагента,
		  |			ВЫБОР
		  |				КОГДА Суммы.ВозвратнаяТара = ИСТИНА
		  |					ТОГДА ""Возвратная тара""
		  |				ИНАЧЕ ""Товары""
		  |			КОНЕЦ КАК ЗаТару,
		  |			Суммы.ВидРасчетов КАК ВидРасчетов,
		  |			ВЫБОР
		  |				КОГДА Суммы.ВозвратнаяТара = ИСТИНА
		  |					ТОГДА Суммы.ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПокупкам
		  |				КОГДА Суммы.ВозвратнаяТара = ЛОЖЬ
		  |					ТОГДА Суммы.ДоговорКонтрагента.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПокупкам
		  |			КОНЕЦ КАК Схема,
		  |			Суммы.ПериодДень КАК ПериодДень,
		  |			Суммы.НалоговыйДокумент КАК НалоговыйДокумент,
		  |			Суммы.Сделка КАК Сделка,
		  |			Суммы.СтавкаНДС КАК СтавкаНДС,
		  |			Суммы.ДляХозяйственнойДеятельности КАК ДляХозяйственнойДеятельности,
		  |			Суммы.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		  |			Суммы.Амортизируется КАК Амортизируется,
		  |			СУММА(Суммы.РасчетыОтгрузНач) КАК РасчетыОтгрузНач,
		  |			СУММА(Суммы.РасчетыОплатаНач) КАК РасчетыОплатаНач,
		  |			СУММА(Суммы.РасчетыОтгрузПрих) КАК РасчетыОтгрузПрих,
		  |			СУММА(Суммы.РасчетыОплатаПрих) КАК РасчетыОплатаПрих,
		  |			СУММА(Суммы.РасчетыОтгрузНачНДС) КАК РасчетыОтгрузНачНДС,
		  |			СУММА(Суммы.РасчетыОплатаНачНДС) КАК РасчетыОплатаНачНДС,
		  |			СУММА(Суммы.РасчетыОтгрузПрихНДС) КАК РасчетыОтгрузПрихНДС,
		  |			СУММА(Суммы.РасчетыОплатаПрихНДС) КАК РасчетыОплатаПрихНДС,
		  |			СУММА(Суммы.ПоДокументу) КАК ПоДокументу,
		  |			СУММА(Суммы.ПоДокументуНДС) КАК ПоДокументуНДС,
		  |			СУММА(Суммы.ВыписаноНН) КАК ВыписаноНН,
		  |			СУММА(Суммы.ВыписаноНННДС) КАК ВыписаноНННДС
		  |		ИЗ
		  |			(ВЫБРАТЬ
		  |				Продажи.Организация КАК Организация,
		  |				Продажи.ДоговорКонтрагента КАК ДоговорКонтрагента,
		  |				Продажи.ВозвратнаяТара КАК ВозвратнаяТара,
		  |				НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ) КАК ПериодДень,
		  |				Продажи.Регистратор КАК НалоговыйДокумент,
		  |				ВЫБОР
		  |					КОГДА Продажи.Событие В (&СобытияРасчет)
		  |						ТОГДА ""Поступление""
		  |					ИНАЧЕ ""Возврат""
		  |				КОНЕЦ КАК ВидРасчетов,
		  |				Продажи.Сделка КАК Сделка,
		  |				Продажи.СтавкаНДС КАК СтавкаНДС,
		  |				Продажи.ДляХозяйственнойДеятельности КАК ДляХозяйственнойДеятельности,
		  |				Продажи.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		  |				Продажи.Амортизируется КАК Амортизируется,
		  |				0 КАК РасчетыОтгрузНач,
		  |				0 КАК РасчетыОплатаНач,
		  |				ВЫБОР
		  |					КОГДА Продажи.Событие В (&СобытияОтгрузка)
		  |						ТОГДА Продажи.СуммаВзаиморасчетовПриход
		  |					ИНАЧЕ 0
		  |				КОНЕЦ КАК РасчетыОтгрузПрих,
		  |				ВЫБОР
		  |					КОГДА Продажи.Событие В (&СобытияОплата)
		  |						ТОГДА Продажи.СуммаВзаиморасчетовПриход
		  |					ИНАЧЕ 0
		  |				КОНЕЦ КАК РасчетыОплатаПрих,
		  |				0 КАК РасчетыОтгрузНачНДС,
		  |				0 КАК РасчетыОплатаНачНДС,
		  |				ВЫБОР
		  |					КОГДА Продажи.Событие В (&СобытияОтгрузка)
		  |						ТОГДА Продажи.СуммаНДСПриход
		  |					ИНАЧЕ 0
		  |				КОНЕЦ КАК РасчетыОтгрузПрихНДС,
		  |				ВЫБОР
		  |					КОГДА Продажи.Событие В (&СобытияОплата)
		  |						ТОГДА Продажи.СуммаНДСПриход
		  |					ИНАЧЕ 0
		  |				КОНЕЦ КАК РасчетыОплатаПрихНДС,
		  |				0 КАК ПоДокументу,
		  |				0 КАК ПоДокументуНДС,
		  |				0 КАК ВыписаноНН,
		  |				0 КАК ВыписаноНННДС
		  |			ИЗ
		  |				РегистрНакопления.ПриобретенияНалоговыйУчет.Обороты(
		  |					&ДатаНачала,
		  |					&ДатаКонца,
		  |					Регистратор,
		  |					(Событие В (&СобытияРасчет)
		  |					    ИЛИ Событие В (&СобытияВозврат))
		  |					    И ИСТИНА {Организация.*, ДоговорКонтрагента.Владелец.* КАК Контрагент, ВозвратнаяТара КАК ЗаТару, ДоговорКонтрагента.*}) КАК Продажи
		  |			
		  |			ОБЪЕДИНИТЬ ВСЕ
		  |			
		  |			ВЫБРАТЬ
		  |				Остатки.Организация,
		  |				Остатки.ДоговорКонтрагента,
		  |				Остатки.ВозвратнаяТара,
		  |				Остатки.Период,
		  |				Остатки.Регистратор,
		  |				ВЫБОР
		  |					КОГДА Остатки.Событие В (&СобытияРасчет)
		  |						ТОГДА ""Поступление""
		  |					ИНАЧЕ ""Возврат""
		  |				КОНЕЦ,
		  |				Остатки.Сделка,
		  |				Остатки.СтавкаНДС,
		  |				Остатки.ДляХозяйственнойДеятельности,
		  |				Остатки.ВидДеятельностиНДС,
		  |				Остатки.Амортизируется,
		  |				ВЫБОР
		  |					КОГДА Остатки.Событие В (&СобытияОтгрузка)
		  |						ТОГДА Остатки.НачальныйОстаток
		  |					ИНАЧЕ 0
		  |				КОНЕЦ,
		  |				ВЫБОР
		  |					КОГДА Остатки.Событие В (&СобытияОплата)
		  |						ТОГДА Остатки.НачальныйОстаток
		  |					ИНАЧЕ 0
		  |				КОНЕЦ,
		  |				0,
		  |				0,
		  |				ВЫБОР
		  |					КОГДА Остатки.Событие В (&СобытияОтгрузка)
		  |						ТОГДА Остатки.НачальныйОстатокНДС
		  |					ИНАЧЕ 0
		  |				КОНЕЦ,
		  |				ВЫБОР
		  |					КОГДА Остатки.Событие В (&СобытияОплата)
		  |						ТОГДА Остатки.НачальныйОстатокНДС
		  |					ИНАЧЕ 0
		  |				КОНЕЦ,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0
		  |			ИЗ
		  |				(ВЫБРАТЬ
		  |					Периоды.Организация КАК Организация,
		  |					Периоды.ДоговорКонтрагента КАК ДоговорКонтрагента,
		  |					Периоды.ВозвратнаяТара КАК ВозвратнаяТара,
		  |					Периоды.Период КАК Период,
		  |					Периоды.Регистратор КАК Регистратор,
		  |					Остатки.Событие КАК Событие,
		  |					Периоды.Сделка КАК Сделка,
		  |					Периоды.СтавкаНДС КАК СтавкаНДС,
		  |					Периоды.ДляХозяйственнойДеятельности КАК ДляХозяйственнойДеятельности,
		  |					Периоды.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		  |					Периоды.Амортизируется КАК Амортизируется,		  
		  |					ЕСТЬNULL(СУММА(Остатки.СуммаНач), 0) КАК НачальныйОстаток,
		  |					ЕСТЬNULL(СУММА(Остатки.СуммаНачНДС), 0) КАК НачальныйОстатокНДС
		  |				ИЗ
		  |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |						Периоды.Организация КАК Организация,
		  |						Периоды.ДоговорКонтрагента КАК ДоговорКонтрагента,
		  |						Периоды.ВозвратнаяТара КАК ВозвратнаяТара,
		  |						НАЧАЛОПЕРИОДА(Периоды.Период, ДЕНЬ) КАК Период,
		  |						Периоды.Регистратор КАК Регистратор,
		  |						Периоды.Сделка КАК Сделка,
		  |						Периоды.СтавкаНДС КАК СтавкаНДС,
		  |						Периоды.ДляХозяйственнойДеятельности КАК ДляХозяйственнойДеятельности,
		  |						Периоды.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		  |						Периоды.Амортизируется КАК Амортизируется
		  |					ИЗ
		  |						РегистрНакопления.ПриобретенияНалоговыйУчет.Обороты(
		  |							&ДатаНачала,
		  |							&ДатаКонца,
		  |							Регистратор,
		  |							(Событие В (&СобытияРасчет)
		  |							    ИЛИ Событие В (&СобытияВозврат))
		  |							    И ИСТИНА {Организация.*, ДоговорКонтрагента.Владелец.* КАК Контрагент, ВозвратнаяТара КАК ЗаТару, ДоговорКонтрагента.*}) КАК Периоды) КАК Периоды
		  |						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		  |							ОстНаНач.Организация КАК Организация,
		  |							ОстНаНач.ДоговорКонтрагента КАК ДоговорКонтрагента,
		  |							ОстНаНач.ВозвратнаяТара КАК ВозвратнаяТара,
		  |							ОстНаНач.Событие КАК Событие,
		  |							0 КАК Регистратор,
		  |							ОстНаНач.Сделка КАК Сделка,
		  |							ОстНаНач.СтавкаНДС КАК СтавкаНДС,
		  |							ОстНаНач.ДляХозяйственнойДеятельности КАК ДляХозяйственнойДеятельности,
		  |							ОстНаНач.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		  |							ОстНаНач.Амортизируется КАК Амортизируется,
		  |							ОстНаНач.СуммаВзаиморасчетовОстаток КАК СуммаНач,
		  |							ОстНаНач.СуммаНДСОстаток КАК СуммаНачНДС
		  |						ИЗ
		  |							РегистрНакопления.ПриобретенияНалоговыйУчет.Остатки(
		  |								&ДатаНачала,
		  |								(Событие В (&СобытияРасчет)
		  |								    ИЛИ Событие В (&СобытияВозврат))
		  |								    И ИСТИНА {Организация.*, ДоговорКонтрагента.Владелец.* КАК Контрагент, ВозвратнаяТара КАК ЗаТару, ДоговорКонтрагента.*}) КАК ОстНаНач
		  |						
		  |						ОБЪЕДИНИТЬ ВСЕ
		  |						
		  |						ВЫБРАТЬ
		  |							Обороты.Организация,
		  |							Обороты.ДоговорКонтрагента,
		  |							Обороты.ВозвратнаяТара,
		  |							Обороты.Событие,
		  |							Обороты.Регистратор,
		  |							Обороты.Сделка,
		  |							Обороты.СтавкаНДС,
		  |							Обороты.ДляХозяйственнойДеятельности,
		  |							Обороты.ВидДеятельностиНДС,
		  |							Обороты.Амортизируется,
		  |							Обороты.СуммаВзаиморасчетовОборот,
		  |							Обороты.СуммаНДСОборот
		  |						ИЗ
		  |							РегистрНакопления.ПриобретенияНалоговыйУчет.Обороты(
		  |								&ДатаНачала,
		  |								&ДатаКонца,
		  |								Регистратор,
		  |								(Событие В (&СобытияРасчет)
		  |								    ИЛИ Событие В (&СобытияВозврат))
		  |								    И ИСТИНА {Организация.*, ДоговорКонтрагента.Владелец.* КАК Контрагент, ВозвратнаяТара КАК ЗаТару, ДоговорКонтрагента.*}) КАК Обороты) КАК Остатки
		  |						ПО Остатки.Организация = Периоды.Организация
		  |							И Остатки.ДоговорКонтрагента = Периоды.ДоговорКонтрагента
		  |							И Остатки.ВозвратнаяТара = Периоды.ВозвратнаяТара
		  |							И Остатки.Сделка = Периоды.Сделка
		  |							И Остатки.СтавкаНДС = Периоды.СтавкаНДС
		  |							И Остатки.ДляХозяйственнойДеятельности = Периоды.ДляХозяйственнойДеятельности
		  |							И Остатки.ВидДеятельностиНДС = Периоды.ВидДеятельностиНДС
		  |							И Остатки.Амортизируется = Периоды.Амортизируется
		  |							И (Остатки.Регистратор = 0
		  |								ИЛИ Остатки.Регистратор.МоментВремени < Периоды.Регистратор.МоментВремени)
		  |				
		  |				СГРУППИРОВАТЬ ПО
		  |					Периоды.Организация,
		  |					Периоды.ДоговорКонтрагента,
		  |					Периоды.ВозвратнаяТара,
		  |					Остатки.Событие,
		  |					Периоды.Период,
		  |					Периоды.Регистратор,
		  |					Периоды.Сделка,
		  |					Периоды.СтавкаНДС,
		  |					Периоды.ДляХозяйственнойДеятельности,
		  |					Периоды.ВидДеятельностиНДС,
		  |					Периоды.Амортизируется) КАК Остатки
		  |			
		  |			ОБЪЕДИНИТЬ ВСЕ
		  |			
		  |			ВЫБРАТЬ
		  |				Документы.Организация,
		  |				Документы.ДоговорКонтрагента,
		  |				Документы.ВозвратнаяТара,
		  |				НАЧАЛОПЕРИОДА(Документы.Период, ДЕНЬ),
		  |				Документы.Регистратор,
		  |				ВЫБОР
		  |					КОГДА Документы.СобытиеНДС = &СобытияНДС_ОиП_Расчет
		  |						ТОГДА ""Поступление""
		  |					ИНАЧЕ ""Возврат""
		  |				КОНЕЦ,
		  |				Документы.Сделка,
		  |				ВЫБОР КОГДА Документы.ДоговорКонтрагента.СложныйНалоговыйУчет ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) ИНАЧЕ Документы.СтавкаНДС КОНЕЦ,
		  |				ВЫБОР КОГДА Документы.ДоговорКонтрагента.СложныйНалоговыйУчет ТОГДА ЛОЖЬ ИНАЧЕ Документы.ДляХозяйственнойДеятельности  КОНЕЦ,
		  |				ВЫБОР КОГДА Документы.ДоговорКонтрагента.СложныйНалоговыйУчет ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПустаяСсылка) ИНАЧЕ Документы.ВидДеятельностиНДС  КОНЕЦ,
		  |				ВЫБОР КОГДА Документы.ДоговорКонтрагента.СложныйНалоговыйУчет ТОГДА ЛОЖЬ ИНАЧЕ Документы.Амортизируется  КОНЕЦ,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				Документы.СуммаНДСРасход + Документы.БазаНДСРасход,
		  |				Документы.СуммаНДСРасход
		  |			ИЗ
		  |				РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений.Обороты(
		  |					&ДатаНачала,
		  |					&ДатаКонца,
		  |					Регистратор,
		  |					(СобытиеНДС = &СобытияНДС_ОиП_Расчет
		  |					    ИЛИ СобытиеНДС = &СобытияНДС_ОиП_Возврат)
		  |					    И ИСТИНА {Организация.*, ДоговорКонтрагента.Владелец.* КАК Контрагент, ВозвратнаяТара КАК ЗаТару, ДоговорКонтрагента.*}) КАК Документы
		  |			
		  |			ОБЪЕДИНИТЬ ВСЕ
		  |			
		  |			ВЫБРАТЬ
		  |				Документы.Организация,
		  |				Документы.ДоговорКонтрагента,
		  |				Документы.ВозвратнаяТара,
		  |				НАЧАЛОПЕРИОДА(Документы.Период, ДЕНЬ),
		  |				Документы.Регистратор,
		  |				ВЫБОР
		  |					КОГДА Документы.СобытиеНДС = &СобытияНДС_ОиП_Расчет
		  |						ТОГДА ""Поступление""
		  |					ИНАЧЕ ""Возврат""
		  |				КОНЕЦ,
		  |				Документы.Сделка,
		  |				ВЫБОР КОГДА Документы.ДоговорКонтрагента.СложныйНалоговыйУчет ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) ИНАЧЕ Документы.СтавкаНДС КОНЕЦ,
		  |				ВЫБОР КОГДА Документы.ДоговорКонтрагента.СложныйНалоговыйУчет ТОГДА ЛОЖЬ ИНАЧЕ Документы.ДляХозяйственнойДеятельности  КОНЕЦ,
		  |				ВЫБОР КОГДА Документы.ДоговорКонтрагента.СложныйНалоговыйУчет ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПустаяСсылка) ИНАЧЕ Документы.ВидДеятельностиНДС  КОНЕЦ,
		  |				ВЫБОР КОГДА Документы.ДоговорКонтрагента.СложныйНалоговыйУчет ТОГДА ЛОЖЬ ИНАЧЕ Документы.Амортизируется  КОНЕЦ,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				0,
		  |				Документы.СуммаНДСПриход + Документы.БазаНДСПриход,
		  |				Документы.СуммаНДСПриход,
		  |				0,
		  |				0
		  |			ИЗ
		  |				РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений.Обороты(
		  |					&ДатаНачала,
		  |					&ДатаКонца,
		  |					Регистратор,
		  |					(СобытиеНДС = &СобытияНДС_ОиП_Расчет
		  |					    ИЛИ СобытиеНДС = &СобытияНДС_ОиП_Возврат)
		  |					    И ИСТИНА {Организация.*, ДоговорКонтрагента.Владелец.* КАК Контрагент, ВозвратнаяТара КАК ЗаТару, ДоговорКонтрагента.*}) КАК Документы) КАК Суммы
		  |		
		  |		СГРУППИРОВАТЬ ПО
		  |			Суммы.Организация,
		  |			Суммы.ДоговорКонтрагента,
		  |			ВЫБОР
		  |				КОГДА Суммы.ВозвратнаяТара = ИСТИНА
		  |					ТОГДА ""Возвратная тара""
		  |				ИНАЧЕ ""Товары""
		  |			КОНЕЦ,
		  |			Суммы.ВидРасчетов,
		  |			Суммы.ПериодДень,
		  |			Суммы.НалоговыйДокумент,
		  |			ВЫБОР
		  |				КОГДА Суммы.ВозвратнаяТара = ИСТИНА
		  |					ТОГДА Суммы.ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПокупкам
		  |				КОГДА Суммы.ВозвратнаяТара = ЛОЖЬ
		  |					ТОГДА Суммы.ДоговорКонтрагента.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПокупкам
		  |			КОНЕЦ,
		  |			Суммы.Сделка,
		  |			Суммы.СтавкаНДС,
		  |			Суммы.ДляХозяйственнойДеятельности,
		  |			Суммы.ВидДеятельностиНДС,
		  |			Суммы.Амортизируется,
		  |			Суммы.ДоговорКонтрагента.Владелец) КАК Данные
		  |	ГДЕ
		  |		(ВЫБОР
		  |					КОГДА Данные.Схема = &ПоОтгрузке
		  |						ТОГДА Данные.РасчетыОтгрузПрих
		  |					КОГДА Данные.Схема = &ПоОплате
		  |						ТОГДА Данные.РасчетыОплатаПрих
		  |					КОГДА Данные.Схема = &ПоПервомуСобытию
		  |						ТОГДА ВЫБОР
		  |								КОГДА Данные.РасчетыОтгрузНач + Данные.РасчетыОтгрузПрих > Данные.РасчетыОплатаНач + Данные.РасчетыОплатаПрих
		  |									ТОГДА Данные.РасчетыОтгрузНач + Данные.РасчетыОтгрузПрих
		  |								ИНАЧЕ Данные.РасчетыОплатаНач + Данные.РасчетыОплатаПрих
		  |							КОНЕЦ - ВЫБОР
		  |								КОГДА Данные.РасчетыОтгрузНач > Данные.РасчетыОплатаНач
		  |									ТОГДА Данные.РасчетыОтгрузНач
		  |								ИНАЧЕ Данные.РасчетыОплатаНач
		  |							КОНЕЦ
		  |					ИНАЧЕ 0
		  |				КОНЕЦ >= 0
		  |				ИЛИ Данные.ВыписаноНН <> 0)) КАК ВложенныйЗапрос
		  |{ГДЕ
		  |	ВложенныйЗапрос.Организация.*,
		  |	ВЫБОР
		  |		КОГДА ВложенныйЗапрос.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		  |				ИЛИ ВложенныйЗапрос.ДоговорКонтрагента.Внешнеэкономический = ЛОЖЬ
		  |			ТОГДА &Гривна
		  |		ИНАЧЕ ВложенныйЗапрос.ДоговорКонтрагента.ВалютаВзаиморасчетов
		  |	КОНЕЦ КАК Валюта,
		  |	ВложенныйЗапрос.Контрагент.*,
		  |	ВложенныйЗапрос.ДоговорКонтрагента.*,
		  |	ВложенныйЗапрос.ЗаТару,
		  |	ВложенныйЗапрос.ВидРасчетов,
		  |	ВложенныйЗапрос.Схема.*,
		  |	ВложенныйЗапрос.ПериодДень,
		  |	ВложенныйЗапрос.СтавкаНДС.*,
		  |	ВложенныйЗапрос.НалоговыйДокумент.*,
		  |	ВложенныйЗапрос.ДляХозяйственнойДеятельности,
		  |	ВложенныйЗапрос.ВидДеятельностиНДС,
		  |	ВложенныйЗапрос.Амортизируется,
		  |	ВложенныйЗапрос.Сделка.*,
		  |	ВложенныйЗапрос.СложныйНалоговыйУчет}
		  |
		  |УПОРЯДОЧИТЬ ПО
		  |	ВидРасчетов УБЫВ
		  |{УПОРЯДОЧИТЬ ПО
		  |	Организация.*,
		  |	Контрагент.*,
		  |	ВидРасчетов,
		  |	ДоговорКонтрагента.*,
		  |	Схема,
		  |	ЗаТару,
		  |	ПериодДень,
		  |	Сделка.*,
		  |	СтавкаНДС,
		  |	ДляХозяйственнойДеятельности,
		  |	ВидДеятельностиНДС,
		  |	Амортизируется,
		  |	НалоговыйДокумент.*}
		  |ИТОГИ
		  |	СУММА(РазницаУчетВыписано),
		  |	СУММА(РазницаУчетВыписаноНДС),
		  |	СУММА(РазницаУчетДокумент),
		  |	СУММА(РазницаУчетДокументНДС),
		  |	СУММА(ПервоеСобытие),
		  |	СУММА(ПервоеСобытиеНДС),
		  |	СУММА(ПоДокументу),
		  |	СУММА(ПоДокументуНДС),
		  |	СУММА(ВыписаноНН),
		  |	СУММА(ВыписаноНННДС)
		  |ПО
		  |	Организация,
		  |	Валюта,
		  |	СложныйНалоговыйУчет,
		  |	Контрагент,
		  |	Схема,
		  |	ДоговорКонтрагента,
		  |	Сделка,
		  |	ЗаТару,
		  |	СтавкаНДС,
		  |	ДляХозяйственнойДеятельности,
		  |	ВидДеятельностиНДС,
		  |	Амортизируется,
		  |	ПериодДень,
		  |	НалоговыйДокумент
		  |{ИТОГИ ПО
		  |	Организация.*,
		  | Валюта,
		  |	Контрагент.*,
		  |	СложныйНалоговыйУчет,
		  |	ДоговорКонтрагента.*,
		  |	ЗаТару,
		  |	ВидРасчетов,
		  |	Схема,
		  |	СтавкаНДС,
		  |	ДляХозяйственнойДеятельности,
		  |	ВидДеятельностиНДС,
		  | Амортизируется,
		  |	Сделка,
		  |	ПериодДень,
		  |	НалоговыйДокумент.*}";
		  
	Если ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов() = "uk" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Возврат""", """Повернення""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Поступление""", """Надходження""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Сложный нал. учет""", """Складний под. облік""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Упрощенный нал. учет""", """Спрощений под. облік""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Для хоз. деят.""", """Для госп. діял.""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Для не хоз. деят.""", """Для не госп. діял.""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Для операций не облаг. НДС""", """Для операцій неопод. ПДВ""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Пропорц. отнесение НДС на кредит""", """Пропорц. віднесення ПДВ на кредит""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Для операций облаг. НДС""", """Для операцій опод. ПДВ""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Амортизируется""", """Амортизується""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Не амортизируется""", """Не амортизується""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Возвратная тара""", """Поворотна тара""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Товары""", """Товари""");
	КонецЕсли;

	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПоОтгрузке", 			Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПоОплате",				Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПоПервомуСобытию",		Перечисления.МоментыОпределенияНалоговойБазы.ПоПервомуСобытию);
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НеоблагаемыйВидДеятельностиНДС",	Перечисления.ВидыДеятельностиНДС.Необлагаемая);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПропорциональныйНДС",	Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Гривна",  							глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПоОтгрузке", 				Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПоОплате",				Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПоПервомуСобытию",		Перечисления.МоментыОпределенияНалоговойБазы.ПоПервомуСобытию);
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НеоблагаемыйВидДеятельностиНДС",		Перечисления.ВидыДеятельностиНДС.Необлагаемая);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Гривна",  					глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	
	МассивСобытияРасчет = Новый Массив();
	МассивСобытияРасчет.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику);
	МассивСобытияРасчет.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СобытияРасчет",			МассивСобытияРасчет);
	
	МассивСобытияВозврат = Новый Массив();
	МассивСобытияВозврат.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком);
	МассивСобытияВозврат.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СобытияВозврат",			МассивСобытияВозврат);
	
	МассивСобытияОтгрузка = Новый Массив();
	МассивСобытияОтгрузка.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ПоступлениеОтПоставщика);
	МассивСобытияОтгрузка.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратПоставщику);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СобытияОтгрузка",			МассивСобытияОтгрузка);
	
	МассивСобытияОплата = Новый Массив();
	МассивСобытияОплата.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ОплатаПоставщику);
	МассивСобытияОплата.Добавить(Перечисления.СобытияПриобретенияНалоговыйУчет.ВозвратОплатыПоставщиком);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СобытияОплата",			МассивСобытияОплата);

	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СобытияНДС_ОиП_Расчет",	Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Поступление);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СобытияНДС_ОиП_Возврат",	Перечисления.СобытияОжидаемыйИПодтвержденныйНДСПриобретений.Возврат);

	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ВалютаРегламентированногоУчета", глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента",		 	НСтр("ru='Договор';uk='Договір'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента",		 	НСтр("ru='Договор';uk='Договір'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент",	 				"Контрагент");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЗаТару",		 				"За тару");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВидРасчетов", 				НСтр("ru='Вид расчетов';uk='Вид розрахунків'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Схема",		 				НСтр("ru='Момент возникновения обязательств';uk=""Момент виникнення зобов'язань"""));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПериодДень",		 			НСтр("ru='Дата возникновения обязательств';uk=""Дата виникнення зобов'язань"""));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НалоговыйДокумент",		 	"Документ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация",		 			НСтр("ru='Организация';uk='Організація'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сделка",		 				НСтр("ru='Сделка';uk='Угода'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Валюта",		 			    "Валюта");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтавкаНДС",		 			НСтр("ru='Ставка НДС';uk='Ставка ПДВ'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДляХозяйственнойДеятельности",НСтр("ru='Для хоз. деят.';uk='Для госп. діяльн.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВидДеятельностиНДС",			НСтр("ru='Вид деят. НДС';uk='Вид діял. ПДВ'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Амортизируется",				НСтр("ru='Амортизируется';uk='Амортизується'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СложныйНалоговыйУчет",		НСтр("ru='Сложн. нал. учет';uk='Складн. под. облік'"));
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель("РазницаУчетВыписано", 	НСтр("ru='Сумма всего';uk='Сума всього'"), 	Истина, "ЧЦ=15; ЧДЦ=2","РазницаУчетВыписано", НСтр("ru='Расхождение между данными учета и полученными налоговыми документами (только упрощ. нал. учет)';uk='Розбіжність між даними обліку і отриманими податковими документами (тільки спрощ. под. облік)'"));
	УниверсальныйОтчет.ДобавитьПоказатель("РазницаУчетВыписаноНДС", НСтр("ru='НДС';uk='ПДВ'"), 					Истина, "ЧЦ=15; ЧДЦ=2","РазницаУчетВыписано");
	
	УниверсальныйОтчет.ДобавитьПоказатель("РазницаУчетДокумент", 	НСтр("ru='Сумма всего';uk='Сума всього'"), Истина, "ЧЦ=15; ЧДЦ=2","РазницаУчетДокумент", НСтр("ru='Расхождение между данными учета и первичными документами (только упрощ. нал. учет)';uk='Розбіжність між даними обліку і первинними документами (тільки спрощ. под. облік)'"));
	УниверсальныйОтчет.ДобавитьПоказатель("РазницаУчетДокументНДС",	НСтр("ru='НДС';uk='ПДВ'"), 		   		   Истина, "ЧЦ=15; ЧДЦ=2","РазницаУчетДокумент");
	
	
	УниверсальныйОтчет.ДобавитьПоказатель("ПоДокументу", 			НСтр("ru='Сумма всего';uk='Сума всього'"), Истина, "ЧЦ=15; ЧДЦ=2","ПоПроводкам", НСтр("ru='Суммы по проводкам документа (только упрощ. нал. учет)';uk='Суми по проводках документа (тільки спрощ. под. облік)'"));
	УниверсальныйОтчет.ДобавитьПоказатель("ПоДокументуНДС", 		НСтр("ru='НДС';uk='ПДВ'"), 				   Истина, "ЧЦ=15; ЧДЦ=2","ПоПроводкам");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ПервоеСобытие", 	    	НСтр("ru='Сумма всего';uk='Сума всього'"), Истина, "ЧЦ=15; ЧДЦ=2","ПервоеСобытие", НСтр("ru='Налоговый кредит';uk='Податковий кредит'"));
	УниверсальныйОтчет.ДобавитьПоказатель("ПервоеСобытиеНДС", 		НСтр("ru='НДС';uk='ПДВ'"), 			       Истина, "ЧЦ=15; ЧДЦ=2","ПервоеСобытие");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ВыписаноНН", 			НСтр("ru='Сумма всего';uk='Сума всього'"), Истина, "ЧЦ=15; ЧДЦ=2","ВыписаноНН",НСтр("ru='Получено налоговых документов';uk='Отримано податкових документів'"));
	УниверсальныйОтчет.ДобавитьПоказатель("ВыписаноНННДС", 			НСтр("ru='НДС (только упрощ. нал. учет)';uk='ПДВ (тільки спрощ. под. облік)'"), 	Истина, "ЧЦ=15; ЧДЦ=2","ВыписаноНН");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	 УниверсальныйОтчет.ДобавитьИзмерениеКолонки("ВидРасчетов");
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Контрагент");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	 
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);
	
КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
УниверсальныйОтчет.мРежимВводаПериода = 0;

#КонецЕсли
